#!/bin/sh
if [ $(id -u) != "0" ]; then
echo "警告：你必须使用 root 用户来执行本一键脚本！"
exit 1
fi

echo '
#############################################
#####     SSR流控防黑一键快速安装包    ######
##### 此脚本只在Centos 6 x64下通过测试 ######
#####   若在非要求系统下执行后果自负   ######
##### 脚本开始工作前会预先安装依赖组件 ######
#############################################'
echo "

服务器是否在国内？输入 “y” 为是其他为否："
read server_location
if [ "$server_location" == "y" ] ; then
echo "nameserver 223.5.5.5" >> /etc/resolv.conf
echo "nameserver 223.6.6.6" >> /etc/resolv.conf
fi
echo "

====================================
正在安装所需基本工具包，请耐心等待！
===================================="